<a href="https://colab.research.google.com/github/kalp2008/Datascient_R_learning/blob/main/Pythonstu1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
!pip install pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.7/dist-packages (1.1.5)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.15.4 in /usr/local/lib/python3.7/dist-packages (from pandas) (1.19.5)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.7/dist-packages (from pandas) (2018.9)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [3]:
#Import Python Libraries
import numpy as np
import pandas as pd
import matplotlib as mpl
import seaborn as sns

In [6]:
df=pd.read_csv("/content/Salaries.csv",index_col=0)

In [7]:
df.head()

       rank discipline  yrs.since.phd  yrs.service   sex  salary
1      Prof          B             19           18  Male  139750
2      Prof          B             20           16  Male  173200
3  AsstProf          B              4            3  Male   79750
4      Prof          B             45           39  Male  115000
5      Prof          B             40           41  Male  141500

In [8]:
df.head(10)

         rank discipline  yrs.since.phd  yrs.service     sex  salary
1        Prof          B             19           18    Male  139750
2        Prof          B             20           16    Male  173200
3    AsstProf          B              4            3    Male   79750
4        Prof          B             45           39    Male  115000
5        Prof          B             40           41    Male  141500
6   AssocProf          B              6            6    Male   97000
7        Prof          B             30           23    Male  175000
8        Prof          B             45           45    Male  147765
9        Prof          B             21           20    Male  119250
10       Prof          B             18           18  Female  129000

In [9]:
df.head(20)

         rank discipline  yrs.since.phd  yrs.service     sex  salary
1        Prof          B             19           18    Male  139750
2        Prof          B             20           16    Male  173200
3    AsstProf          B              4            3    Male   79750
4        Prof          B             45           39    Male  115000
5        Prof          B             40           41    Male  141500
6   AssocProf          B              6            6    Male   97000
7        Prof          B             30           23    Male  175000
8        Prof          B             45           45    Male  147765
9        Prof          B             21           20    Male  119250
10       Prof          B             18           18  Female  129000
11  AssocProf          B             12            8    Male  119800
12   AsstProf          B              7            2    Male   79800
13   AsstProf          B              1            1    Male   77700
14   AsstProf          B              2            0    Male   78000
15       Prof          B             20           18    Male  104800
16       Prof          B             12            3    Male  117150
17       Prof          B             19           20    Male  101000
18       Prof          A             38           34    Male  103450
19       Prof          A             37           23    Male  124750
20       Prof          A             39           36  Female  137000

In [10]:
df.head(50)

         rank discipline  yrs.since.phd  yrs.service     sex  salary
1        Prof          B             19           18    Male  139750
2        Prof          B             20           16    Male  173200
3    AsstProf          B              4            3    Male   79750
4        Prof          B             45           39    Male  115000
5        Prof          B             40           41    Male  141500
6   AssocProf          B              6            6    Male   97000
7        Prof          B             30           23    Male  175000
8        Prof          B             45           45    Male  147765
9        Prof          B             21           20    Male  119250
10       Prof          B             18           18  Female  129000
11  AssocProf          B             12            8    Male  119800
12   AsstProf          B              7            2    Male   79800
13   AsstProf          B              1            1    Male   77700
14   AsstProf          B              2            0    Male   78000
15       Prof          B             20           18    Male  104800
16       Prof          B             12            3    Male  117150
17       Prof          B             19           20    Male  101000
18       Prof          A             38           34    Male  103450
19       Prof          A             37           23    Male  124750
20       Prof          A             39           36  Female  137000
21       Prof          A             31           26    Male   89565
22       Prof          A             36           31    Male  102580
23       Prof          A             34           30    Male   93904
24       Prof          A             24           19    Male  113068
25  AssocProf          A             13            8  Female   74830
26       Prof          A             21            8    Male  106294
27       Prof          A             35           23    Male  134885
28   AsstProf          B              5            3    Male   82379
29   AsstProf          B             11            0    Male   77000
30       Prof          B             12            8    Male  118223
31       Prof          B             20            4    Male  132261
32   AsstProf          B              7            2    Male   79916
33       Prof          B             13            9    Male  117256
34   AsstProf          B              4            2    Male   80225
35   AsstProf          B              4            2  Female   80225
36   AsstProf          B              5            0  Female   77000
37       Prof          B             22           21    Male  155750
38   AsstProf          B              7            4    Male   86373
39       Prof          B             41           31    Male  125196
40  AssocProf          B              9            9    Male  100938
41       Prof          B             23            2    Male  146500
42  AssocProf          B             23           23    Male   93418
43       Prof          B             40           27    Male  101299
44       Prof          B             38           38    Male  231545
45       Prof          B             19           19    Male   94384
46       Prof          B             25           15    Male  114778
47       Prof          B             40           28    Male   98193
48       Prof          B             23           19  Female  151768
49       Prof          B             25           25  Female  140096
50   AsstProf          B              1            1    Male   70768

In [11]:
df.reset_index

<bound method DataFrame.reset_index of          rank discipline  yrs.since.phd  yrs.service   sex  salary
1        Prof          B             19           18  Male  139750
2        Prof          B             20           16  Male  173200
3    AsstProf          B              4            3  Male   79750
4        Prof          B             45           39  Male  115000
5        Prof          B             40           41  Male  141500
..        ...        ...            ...          ...   ...     ...
393      Prof          A             33           30  Male  103106
394      Prof          A             31           19  Male  150564
395      Prof          A             42           25  Male  101738
396      Prof          A             25           15  Male   95329
397  AsstProf          A              8            4  Male   81035

[397 rows x 6 columns]>

In [12]:
df.dtypes

rank             object
discipline       object
yrs.since.phd     int64
yrs.service       int64
sex              object
salary            int64
dtype: object

In [14]:
df.columns

Index(['rank', 'discipline', 'yrs.since.phd', 'yrs.service', 'sex', 'salary'], dtype='object')

In [15]:
df.axes

[Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
             ...
             388, 389, 390, 391, 392, 393, 394, 395, 396, 397],
            dtype='int64', length=397),
 Index(['rank', 'discipline', 'yrs.since.phd', 'yrs.service', 'sex', 'salary'], dtype='object')]

In [16]:
df.ndim

2

In [17]:
df.hist

<bound method hist_frame of          rank discipline  yrs.since.phd  yrs.service   sex  salary
1        Prof          B             19           18  Male  139750
2        Prof          B             20           16  Male  173200
3    AsstProf          B              4            3  Male   79750
4        Prof          B             45           39  Male  115000
5        Prof          B             40           41  Male  141500
..        ...        ...            ...          ...   ...     ...
393      Prof          A             33           30  Male  103106
394      Prof          A             31           19  Male  150564
395      Prof          A             42           25  Male  101738
396      Prof          A             25           15  Male   95329
397  AsstProf          A              8            4  Male   81035

[397 rows x 6 columns]>

In [19]:
df.discipline

1      B
2      B
3      B
4      B
5      B
      ..
393    A
394    A
395    A
396    A
397    A
Name: discipline, Length: 397, dtype: object

In [20]:
df.tail

<bound method NDFrame.tail of          rank discipline  yrs.since.phd  yrs.service   sex  salary
1        Prof          B             19           18  Male  139750
2        Prof          B             20           16  Male  173200
3    AsstProf          B              4            3  Male   79750
4        Prof          B             45           39  Male  115000
5        Prof          B             40           41  Male  141500
..        ...        ...            ...          ...   ...     ...
393      Prof          A             33           30  Male  103106
394      Prof          A             31           19  Male  150564
395      Prof          A             42           25  Male  101738
396      Prof          A             25           15  Male   95329
397  AsstProf          A              8            4  Male   81035

[397 rows x 6 columns]>

In [22]:
df.shape

(397, 6)

In [23]:
df.values

array([['Prof', 'B', 19, 18, 'Male', 139750],
       ['Prof', 'B', 20, 16, 'Male', 173200],
       ['AsstProf', 'B', 4, 3, 'Male', 79750],
       ...,
       ['Prof', 'A', 42, 25, 'Male', 101738],
       ['Prof', 'A', 25, 15, 'Male', 95329],
       ['AsstProf', 'A', 8, 4, 'Male', 81035]], dtype=object)

In [24]:
df.size

2382

In [25]:
df.axes

[Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
             ...
             388, 389, 390, 391, 392, 393, 394, 395, 396, 397],
            dtype='int64', length=397),
 Index(['rank', 'discipline', 'yrs.since.phd', 'yrs.service', 'sex', 'salary'], dtype='object')]

In [26]:
dir(df)

['T',
 '_AXIS_LEN',
 '_AXIS_NAMES',
 '_AXIS_NUMBERS',
 '_AXIS_ORDERS',
 '_AXIS_REVERSED',
 '_AXIS_TO_AXIS_NUMBER',
 '__abs__',
 '__add__',
 '__and__',
 '__annotations__',
 '__array__',
 '__array_priority__',
 '__array_wrap__',
 '__bool__',
 '__class__',
 '__contains__',
 '__copy__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__div__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__imod__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__lt__',
 '__matmul__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdiv__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmatmul__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_add_numeric_operations',
 '_add_series_or_dataframe_operations',
 '_agg_by_level',
 '_agg_examples_doc',
 '_agg_summary_and_see_also_doc',
 '_aggregate',
 '_aggregate_multiple_funcs',
 '_align_frame',
 '_align_series',
 '_box_col_values',
 '_builtin_table',
 '_can_fast_transpose',
 '_check_inplace_setting',
 '_check_is_chained_assignment_possible',
 '_check_label_or_level_ambiguity',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_one_bound',
 '_clip_with_scalar',
 '_combine_frame',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_axes_from_arguments',
 '_construct_result',
 '_constructor',
 '_constructor_expanddim',
 '_constructor_sliced',
 '_convert',
 '_count_level',
 '_cython_table',
 '_data',
 '_deprecations',
 '_dir_additions',
 '_dir_deletions',
 '_drop_axis',
 '_drop_labels_or_levels',
 '_ensure_valid_index',
 '_find_valid_index',
 '_from_arrays',
 '_get_agg_axis',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cacher',
 '_get_cleaned_column_resolvers',
 '_get_column_array',
 '_get_cython_func',
 '_get_index_resolvers',
 '_get_item_cache',
 '_get_label_or_level_values',
 '_get_numeric_data',
 '_get_value',
 '_getitem_bool_array',
 '_getitem_multilevel',
 '_gotitem',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_info_repr',
 '_init_mgr',
 '_internal_names',
 '_internal_names_set',
 '_is_builtin_func',
 '_is_cached',
 '_is_copy',
 '_is_homogeneous_type',
 '_is_label_or_level_reference',
 '_is_label_reference',
 '_is_level_reference',
 '_is_mixed_type',
 '_is_view',
 '_iset_item',
 '_iter_column_arrays',
 '_ix',
 '_ixs',
 '_join_compat',
 '_maybe_cache_changed',
 '_maybe_update_cacher',
 '_metadata',
 '_needs_reindex_multi',
 '_obj_with_exclusions',
 '_protect_consolidate',
 '_reduce',
 '_reindex_axes',
 '_reindex_columns',
 '_reindex_index',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_replace_columnwise',
 '_repr_data_resource_',
 '_repr_fits_horizontal_',
 '_repr_fits_vertical_',
 '_repr_html_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_sanitize_column',
 '_selected_obj',
 '_selection',
 '_selection_list',
 '_selection_name',
 '_series',
 '_set_as_cached',
 '_set_axis',
 '_set_axis_name',
 '_set_is_copy',
 '_set_item',
 '_set_value',
 '_setitem_array',
 '_setitem_frame',
 '_setitem_slice',
 '_slice',
 '_stat_axis',
 '_stat_axis_name',
 '_stat_axis_number',
 '_take_with_is_copy',
 '_to_dict_of_blocks',
 '_try_aggregate_string_function',
 '_typ',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'applymap',
 'asfreq',
 'asof',
 'assign',
 'astype',
 'at',
 'at_time',
 'attrs',
 'axes',
 'backfill',
 'between_time',
 'bfill',
 'bool',
 'boxplot',
 'clip',
 'columns',
 'combine',
 'combine_first',
 'compare',
 'convert_dtypes',
 'copy',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'discipline',
 'div',
 'divide',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'eval',
 'ewm',
 'expanding',
 'explode',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'floordiv',
 'from_dict',
 'from_records',
 'ge',
 'get',
 'groupby',
 'gt',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'info',
 'insert',
 'interpolate',
 'isin',
 'isna',
 'isnull',
 'items',
 'iteritems',
 'iterrows',
 'itertuples',
 'join',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lookup',
 'lt',
 'mad',
 'mask',
 'max',
 'mean',
 'median',
 'melt',
 'memory_usage',
 'merge',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pad',
 'pct_change',
 'pipe',
 'pivot',
 'pivot_table',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'query',
 'radd',
 'rank',
 'rdiv',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'salary',
 'sample',
 'select_dtypes',
 'sem',
 'set_axis',
 'set_index',
 'sex',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'squeeze',
 'stack',
 'std',
 'style',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dict',
 'to_excel',
 'to_feather',
 'to_gbq',
 'to_hdf',
 'to_html',
 'to_json',
 'to_latex',
 'to_markdown',
 'to_numpy',
 'to_parquet',
 'to_period',
 'to_pickle',
 'to_records',
 'to_sql',
 'to_stata',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tz_convert',
 'tz_localize',
 'unstack',
 'update',
 'value_counts',
 'values',
 'var',
 'where',
 'xs']

In [27]:
df.describe()

       yrs.since.phd  yrs.service         salary
count     397.000000   397.000000     397.000000
mean       22.314861    17.614610  113706.458438
std        12.887003    13.006024   30289.038695
min         1.000000     0.000000   57800.000000
25%        12.000000     7.000000   91000.000000
50%        21.000000    16.000000  107300.000000
75%        32.000000    27.000000  134185.000000
max        56.000000    60.000000  231545.000000

In [28]:
df.tail(10)

         rank discipline  yrs.since.phd  yrs.service   sex  salary
388      Prof          A             29           15  Male  109305
389      Prof          A             38           36  Male  119450
390      Prof          A             33           18  Male  186023
391      Prof          A             40           19  Male  166605
392      Prof          A             30           19  Male  151292
393      Prof          A             33           30  Male  103106
394      Prof          A             31           19  Male  150564
395      Prof          A             42           25  Male  101738
396      Prof          A             25           15  Male   95329
397  AsstProf          A              8            4  Male   81035

In [30]:
df.mean()

yrs.since.phd        22.314861
yrs.service          17.614610
salary           113706.458438
dtype: float64

In [31]:
df.median()

yrs.since.phd        21.0
yrs.service          16.0
salary           107300.0
dtype: float64

In [32]:
df.dropna()

         rank discipline  yrs.since.phd  yrs.service   sex  salary
1        Prof          B             19           18  Male  139750
2        Prof          B             20           16  Male  173200
3    AsstProf          B              4            3  Male   79750
4        Prof          B             45           39  Male  115000
5        Prof          B             40           41  Male  141500
..        ...        ...            ...          ...   ...     ...
393      Prof          A             33           30  Male  103106
394      Prof          A             31           19  Male  150564
395      Prof          A             42           25  Male  101738
396      Prof          A             25           15  Male   95329
397  AsstProf          A              8            4  Male   81035

[397 rows x 6 columns]

In [33]:
df.std()

yrs.since.phd       12.887003
yrs.service         13.006024
salary           30289.038695
dtype: float64

In [39]:
df_50=df.head(50)

In [36]:
df.describe()

       yrs.since.phd  yrs.service         salary
count     397.000000   397.000000     397.000000
mean       22.314861    17.614610  113706.458438
std        12.887003    13.006024   30289.038695
min         1.000000     0.000000   57800.000000
25%        12.000000     7.000000   91000.000000
50%        21.000000    16.000000  107300.000000
75%        32.000000    27.000000  134185.000000
max        56.000000    60.000000  231545.000000

In [41]:
df_50.mean()

yrs.since.phd        20.92
yrs.service          16.22
salary           112625.64
dtype: float64

In [43]:
df.head(50).mean()

yrs.since.phd        20.92
yrs.service          16.22
salary           112625.64
dtype: float64

In [44]:
df.tail(10).median()

yrs.since.phd        32.0
yrs.service          19.0
salary           114377.5
dtype: float64

In [46]:
df.std()

yrs.since.phd       12.887003
yrs.service         13.006024
salary           30289.038695
dtype: float64

In [52]:
df.salary

1      139750
2      173200
3       79750
4      115000
5      141500
        ...
393    103106
394    150564
395    101738
396     95329
397     81035
Name: salary, Length: 397, dtype: int64

In [54]:
df[['salary']]

     salary
1    139750
2    173200
3     79750
4    115000
5    141500
..      ...
393  103106
394  150564
395  101738
396   95329
397   81035

[397 rows x 1 columns]

In [63]:
df_phd=df['yrs.since.phd']

In [65]:
df_phd.describe()

count    397.000000
mean      22.314861
std       12.887003
min        1.000000
25%       12.000000
50%       21.000000
75%       32.000000
max       56.000000
Name: yrs.since.phd, dtype: float64

In [66]:
df_phd.count()

397

In [67]:
df_phd.mean()

22.31486146095718

In [68]:
df[['yrs.since.phd']].describe()

       yrs.since.phd
count     397.000000
mean       22.314861
std        12.887003
min         1.000000
25%        12.000000
50%        21.000000
75%        32.000000
max        56.000000

In [70]:
df[['yrs.since.phd']].count()

yrs.since.phd    397
dtype: int64

In [71]:
df[['yrs.since.phd']].mean()

yrs.since.phd    22.314861
dtype: float64

In [72]:
df[['yrs.since.phd']].median()

yrs.since.phd    21.0
dtype: float64

In [73]:
df.groupby(['rank']).mean()

           yrs.since.phd  yrs.service         salary
rank
AssocProf      15.453125    11.953125   93876.437500
AsstProf        5.104478     2.373134   80775.985075
Prof           28.300752    22.815789  126772.109023

In [74]:
df.groupby(['rank']).median()

           yrs.since.phd  yrs.service    salary
rank
AssocProf           12.0          8.0   95626.5
AsstProf             4.0          3.0   79800.0
Prof                28.0         21.0  123321.5

In [82]:
df.groupby('rank')[['salary','yrs.since.phd']].mean()

                  salary  yrs.since.phd
rank
AssocProf   93876.437500      15.453125
AsstProf    80775.985075       5.104478
Prof       126772.109023      28.300752

In [83]:
df.groupby('rank')[['yrs.since.phd']].mean()

           yrs.since.phd
rank
AssocProf      15.453125
AsstProf        5.104478
Prof           28.300752

In [85]:
df['salary']>120000

1       True
2       True
3      False
4      False
5       True
       ...
393    False
394     True
395    False
396    False
397    False
Name: salary, Length: 397, dtype: bool

In [87]:
df[df['salary']>120000]

     rank discipline  yrs.since.phd  yrs.service   sex  salary
1    Prof          B             19           18  Male  139750
2    Prof          B             20           16  Male  173200
5    Prof          B             40           41  Male  141500
7    Prof          B             30           23  Male  175000
8    Prof          B             45           45  Male  147765
..    ...        ...            ...          ...   ...     ...
387  Prof          A             29           27  Male  139219
390  Prof          A             33           18  Male  186023
391  Prof          A             40           19  Male  166605
392  Prof          A             30           19  Male  151292
394  Prof          A             31           19  Male  150564

[142 rows x 6 columns]

In [97]:
df_discipline=df[['discipline','yrs.since.phd']]

In [98]:
df_discipline.head()

  discipline  yrs.since.phd
1          B             19
2          B             20
3          B              4
4          B             45
5          B             40

In [105]:
df[(df['discipline']=='B') & (df['yrs.since.phd']>=20)]

     rank discipline  yrs.since.phd  yrs.service   sex  salary
2    Prof          B             20           16  Male  173200
4    Prof          B             45           39  Male  115000
5    Prof          B             40           41  Male  141500
7    Prof          B             30           23  Male  175000
8    Prof          B             45           45  Male  147765
..    ...        ...            ...          ...   ...     ...
351  Prof          B             56           49  Male  186960
352  Prof          B             38           38  Male   93519
353  Prof          B             26           27  Male  142500
354  Prof          B             22           20  Male  138000
356  Prof          B             25           21  Male  145028

[100 rows x 6 columns]

In [135]:
df.iloc[0:2,4:]

    sex  salary
1  Male  139750
2  Male  173200

In [136]:
df.iloc[2:4,2:5]

   yrs.since.phd  yrs.service   sex
3              4            3  Male
4             45           39  Male

In [125]:
df.iloc[[2,3,4],[0,1,2]]

       rank discipline  yrs.since.phd
3  AsstProf          B              4
4      Prof          B             45
5      Prof          B             40

In [ ]:
from google.colab import drive
drive.mount('/content/drive')